# 如何查看变量在内存中的地址? -- id()
# 写代码
#
# p1.实现用户输入用户名和密码,当用户名为 seven 且 密码为 123 时,显示登陆成功,否则登陆失败!
# p2.实现用户输入用户名和密码,当用户名为 seven 且 密码为 123 时,显示登陆成功,否则登陆失败,失败时允许重复输入三次
# p3.实现用户输入用户名和密码,当用户名为 seven 或 alex 且 密码为 123 时,显示登陆成功,否则登陆失败,失败时允许重复输入三次




#
# 写代码
# p4.使用while循环实现输出2-3+4-5+6...+100 的和
# p5.使用 while 循环实现输出 1,2,3,4,5, 7,8,9, 11,12 d. 使用 while 循环实现输出 1-100 内的所有奇数
# p6. 使用 while 循环实现输出 1-100 内的所有奇数
# p7.使用 while 循环实现输出 1-100 内的所有偶数
#
# 现有如下两个变量,请简述 n1 和 n2 是什么关系?
#
# n1 = 123456
# n2 = n1
#
# p8.使用while循环输出1 2 3 4 5 6     8 9 10
# p9.求1-100的所有数的和
# p10.输出 1-100 内的所有奇数
# p11.输出 1-100 内的所有偶数
# p12.求1-2+3-4+5 ... 99的所有数的和
# p13.用户登陆（三次机会重试）
#
# 编写登陆接口
#
# 基础需求：
#
#     让用户输入用户名密码
#     认证成功后显示欢迎信息
#     输错三次后退出程序
#
# 升级需求：
#
#     可以支持多个用户登录 (提示，通过列表存多个账户信息)
#     用户3次认证失败后，退出程序，再次启动程序尝试登录时，还是锁定状态（提示:需把用户锁定的状态存到文件里）
