'''
Python编程知识-奖金分配


企业发放的奖金根据利润提成。 利润(I)低于或等于10 万元时，奖金可提10%；

利润高于10 万元，低于20 万元时，低于10 万元的部分按10%提成，高于10 万元的部分，可可提成7.5%；

20 万到40 万之间时，高于20 万元的部分，可提成5%；

40 万到60 万之间时高于40 万元的部分，可提成3%；

60 万到100 万之间时，高于60 万元的部分，可提成1.5%；

高于100 万元时，超过100 万元的部分按1%提成，

从键盘输入当月利润I，求应发放奖金总数？
代码实现

请在下面 cell 中编写代码，实现题目描述的要求。

'''
def happy():
    I = input('利润：').strip()
    if I.isdigit(): I = int(I)

    b0 = 100000 * 10/100
    b10 = b0 + 100000 * 7.5/100
    b20 = b10 + 200000 * 5/100
    b40 = b20 + 200000 * 3/100
    b60 = b40 + 400000 * 1.5/100
    #b100 = b60 + (1000000-I) * 1/100
    happys=0

    # 101w 的话， 利润等于 10w*10% + 10w*7.5% + 20w*5% + 20w*3% + 40w*1.5% +1w*1%
    if I > 1000000:
        happys = b60 + (I - 1000000) * 1/100
    elif I > 600000 and I <= 1000000:
        happys = b40 + (I - 600000) * 1.5/100
    elif I > 400000 and I <= 600000:
        happys = b20 + (I - 400000) * 3/100
    elif I > 200000 and I <= 400000:
        happys = b10 + (I - 200000) * 5/100
    elif I > 100000 and I <= 200000:
        happys = b0 + (I - 100000) * 7.5/100
    elif I <= 100000 :
        happys = I * 10/100
    print(f'分红{happys}元钱')
    return 0

while 1:
    happy()


